**Question 1:** 1. Create a table called employees with the following structure?
- emp_id (integer, should not be NULL and should be a primary key)
- emp_name (text, should not be NULL)
- age (integer, should have a check constraint to ensure the age is at least 18)
- email (text, should be unique for each employee)
- salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

**Ans:**
```sql
CREATE TABLE employees (
    -- emp_id is an integer, cannot be empty, and is the primary key for the table.
    emp_id INTEGER NOT NULL PRIMARY KEY,

    -- emp_name is a text field and cannot be empty.
    emp_name TEXT NOT NULL,

    -- age is an integer and must be 18 or greater.
    age INTEGER CHECK (age >= 18),

    -- email is a text field and must be unique for each employee record.
    email TEXT UNIQUE,

    -- salary is a decimal number with a default value of 30000.00 if not specified.
    salary DECIMAL DEFAULT 30000.00
);

```

In [ ]:
# -----------------------------------------------------------------------------------------------------------------

**Qus 2:**  Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

**Ans:** SQL constraints are rules enforced on the data columns of a table to ensure the accuracy and reliability of the data. Their primary purpose is to maintain data integrity by preventing invalid or inconsistent data from being entered into the database. Think of them as gatekeepers for your data.

By setting these rules, you control the type and format of data that can be stored, which is crucial for building a robust and trustworthy database. When an action (like an INSERT, UPDATE, or DELETE) violates a constraint, the database system rejects the operation.


**Common Types of Constraints**
Here are some of the most common constraints used in SQL, along with examples:
  - NOT NULL: This constraint ensures that a column cannot have a NULL (empty) value. It's essential for fields that must always contain information.
    - Example: In a users table, the username and password columns should not be empty.
  - UNIQUE: This ensures that every value in a column is different from all other values in that same column.
    - Example: An email address or a social_security_number in a customer table must be unique for each customer.
  - PRIMARY KEY: This constraint is a combination of NOT NULL and UNIQUE. It uniquely identifies each record in a table. A table can have only one primary key.
    - Example: An employee_id in an employees table serves as the primary key to distinguish each employee.
  - FOREIGN KEY: This key links two tables together by referencing the PRIMARY KEY of another table. It enforces referential integrity, meaning you can't add a record to one table that refers to a non-existent record in another.
    - Example: An orders table might have a customer_id that is a FOREIGN KEY pointing to the id in the customers table. This prevents an order from being created for a customer who doesn't exist.
  - CHECK: This constraint ensures that the values in a column satisfy a specific condition or logical expression.
    - Example: In a products table, you could have a CHECK (price >= 0) constraint to ensure the price is never a negative number.
  - DEFAULT: This provides a default value for a column when no value is specified during an INSERT operation.
    - Example: A registration_date column in a users table could have a DEFAULT value of the current date.

In [ ]:
# ------------------------------------------------------------------------------------------------------

**Qus 3:** Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.

**Ans:** You would apply the NOT NULL constraint to a column to guarantee that every record in the table has a value for that specific attribute. It's a fundamental rule of data integrity that ensures essential information is always present.

**The primary reasons for using it are:**
  1. To Ensure Completeness: For certain fields, missing data makes a record meaningless or useless. For example, an orders table without a product_id or a users table without a username is incomplete and serves no purpose.
  2. To Avoid Errors in Calculations and Functions: NULL is not the same as zero or an empty string; it represents an unknown or missing value. Mathematical operations (like SUM, AVG) or other functions can behave unexpectedly or produce errors when they encounter NULL values. Forcing a column to be NOT NULL ensures predictable behavior.
  3. To Improve Data Quality and Reliability: By requiring certain data to be present, you enforce a higher standard of data quality from the moment it is entered. This makes the entire database more reliable and trustworthy for queries and reports.

  ( Example: In an employees table, the emp_name and start_date columns should be NOT NULL. An employee record without a name or a start date is incomplete and could cause issues in HR and payroll systems. )

---
(**Can a Primary Key Contain NULL Values?**)

No, a primary key cannot contain NULL values.

**Justification:** The entire purpose of a primary key is to serve as a unique identifier for every single row in a table. It's the definitive address for a record, ensuring that you can find and reference it without any ambiguity.

This core purpose relies on two fundamental principles, which are automatically enforced by the PRIMARY KEY constraint:
  1. Uniqueness: Every value in the primary key column must be unique. You can't have two employees with the same employee_id.
  2. Existence: Every record must have a primary key value.

If a primary key were allowed to be NULL, it would directly violate this second principle. A NULL value signifies an "unknown" or "missing" identifier. If one or more rows had a NULL primary key, they would no longer be uniquely identifiable. How would you distinguish between two different records if both had a NULL ID? You couldn't.

Therefore, by definition, a PRIMARY KEY constraint is functionally a combination of the UNIQUE and NOT NULL constraints. This is a non-negotiable rule in relational database design because it's the bedrock upon which data integrity and relationships between tables are built.

In [ ]:
# -----------

**Qus 4:**  Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.

**Ans:** Modifying constraints on an existing table is a common database maintenance task. The process is managed using the ALTER TABLE command.

Here’s a breakdown of the steps and commands for both adding and removing constraints.

**Steps and SQL Commands**

**Adding Constraints to an Existing Table:** To add a constraint, you use the ALTER TABLE statement combined with the ADD CONSTRAINT clause.

**Steps:**
  1. Identify the Target: Pinpoint the table and the column(s) you want to constrain.
  2. Name the Constraint: It is a critical best practice to give your constraint a unique, descriptive name (e.g., fk_orders_customer_id). This makes it much easier to identify, manage, or remove later.
  3. Define the Constraint: Specify the type and logic of the constraint (e.g., UNIQUE(column_name), CHECK (condition), FOREIGN KEY (...) REFERENCES ...).

  ```sql
  ALTER TABLE table_name
  ADD CONSTRAINT constraint_name constraint_definition;
  ```

**Removing Constraints from an Existing Table:** To remove a constraint, you also use the ALTER TABLE statement, but with the DROP CONSTRAINT clause.

**Steps:**
  1. Identify the Target: Know which table the constraint belongs to.
  2. Find the Constraint's Name: You must know the exact name of the constraint you wish to remove. This is why naming them properly is so important!
  3. Execute the Command: Use the DROP CONSTRAINT command to remove it.
  ```sql
  ALTER TABLE table_name
  DROP CONSTRAINT constraint_name;
  ```

(Note: The exact syntax can vary slightly between database systems (e.g., MySQL, PostgreSQL, SQL Server). The examples below use standard SQL that is widely supported.)

**Examples:**
Let's assume we have an existing products table with the following structure:
```sql
CREATE TABLE products (
    product_id INTEGER PRIMARY KEY,
    sku_code TEXT,
    price DECIMAL,
    category_id INTEGER
);
```
Example 1: Adding a UNIQUE Constraint

Goal: We forgot to ensure that every sku_code is unique. Let's add that constraint now.
```sql
ALTER TABLE products
ADD CONSTRAINT uq_products_sku_code UNIQUE (sku_code);
```

Explanation:
  * ALTER TABLE products: We are modifying the products table.
  * ADD CONSTRAINT uq_products_sku_code: We are adding a new constraint named uq_products_sku_code.
  * UNIQUE (sku_code): The constraint's definition is to enforce uniqueness on the sku_code column.

(If you try to INSERT a new product with a sku_code that already exists, the database will now return an error.)

---
Example 2: Removing the UNIQUE Constraint

Goal: The business requirements have changed, and now we need to remove the uniqueness rule on sku_code.
```sql
ALTER TABLE products
DROP CONSTRAINT uq_products_sku_code;
```

Explanation:
  * ALTER TABLE products: We are modifying the products table.
  * DROP CONSTRAINT uq_products_sku_code: We are removing the constraint with this specific name.

(After running this command, the sku_code column will no longer enforce uniqueness, and duplicate values will be allowed.)

In [ ]:
# ----------

**Qus 5:** Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

**Ans:** When you attempt to perform an operation (INSERT, UPDATE, or DELETE) that violates a constraint, the database management system (DBMS) acts as a strict gatekeeper. It will not allow the operation to proceed because doing so would compromise the integrity of the data.

**The Consequences of a Violation**

The consequences are immediate and designed to protect the database at all costs:
  1. The Operation is Rejected: The DBMS immediately stops the execution of the SQL command. The requested change is not made to the table.
  2. An Error Message is Returned: The database sends a descriptive error message back to the application or user who issued the command. This message explains which constraint was violated and often provides details about the conflicting data.
  3. The Transaction is Rolled Back: Database operations are typically performed within a transaction. If any part of a transaction violates a constraint, the entire transaction is aborted and rolled back. This ensures the database remains in a consistent state, as if the operation never happened. No partial or invalid data is left behind.
  4. Data Integrity is Preserved: This is the ultimate goal. By rejecting the invalid operation, the database ensures that all its rules are followed and the data remains accurate, reliable, and consistent.

Let's look at how this applies to specific operations:
  * During an INSERT: If you try to insert a new row that violates a PRIMARY KEY (duplicate ID), UNIQUE (duplicate email), NOT NULL (leaving a required field empty), or CHECK (e.g., age below 18) constraint, the insertion will fail.
  * During an UPDATE: If you try to update an existing row and change a value to something that violates a constraint (e.g., updating an email to one that already exists), the update will be rejected.
  * During a DELETE: This most commonly involves a FOREIGN KEY constraint. If you try to delete a record from a "parent" table (e.g., deleting a customer from the customers table) while there are still records in a "child" table that reference it (e.g., orders in the orders table for that customer), the deletion will be blocked to prevent creating "orphaned" records.

(Example of an Error Message)

Let's use the employees table we defined earlier, which has a UNIQUE constraint on the email column.
```sql
CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000.00
);
```
Step 1: Insert a valid record.
```sql
INSERT INTO employees (emp_id, emp_name, age, email)
VALUES (101, 'Jane Doe', 34, 'j.doe@company.com');
```
This operation succeeds because it follows all the rules.

Step 2: Attempt to insert another record that violates the UNIQUE constraint.

Now, we try to add another employee but accidentally use the same email address.
```sql
INSERT INTO employees (emp_id, emp_name, age, email)
VALUES (102, 'John Smith', 29, 'j.doe@company.com');
```

The Consequence: An Error Message
The database will reject this INSERT statement and return an error message. The exact wording varies between database systems (like PostgreSQL, SQL Server, MySQL), but it will look something like this (this example is typical of SQL):
```
#1062 - Duplicate entry 'j.doe@company.com' for key 'email'
```
Let's break down this error:

  - ERROR: Duplicate entry value violates unique constraint: This clearly states the problem.
  - "employees_email_key": This is the name of the specific constraint that was violated.

(The database remains unchanged; the record for 'John Smith' was not added, and the integrity of our data is secure.)

In [ ]:
# -------------

**Qus 6:** You created a products table without constraints as follows:
```sql
CREATE TABLE products ( product_id INT, product_name VARCHAR(50), price DECIMAL(10, 2));
```
Now, you realise that?
  - The product_id should be a primary keyQ
  - The price should have a default value of 50.00

**Ans:** Here are the SQL commands to apply these changes to your existing products table using the ALTER TABLE statement.

```sql
-- This script adds a PRIMARY KEY and a DEFAULT constraint to the existing 'products' table.

-- Step 1: Add the PRIMARY KEY constraint to the product_id column.
-- It's good practice to first ensure the column is NOT NULL, as a primary key cannot contain NULL values.
-- Note: Some database systems require these to be separate steps.

-- First, modify the column to not allow NULLs.
ALTER TABLE products
MODIFY COLUMN product_id INT NOT NULL;

-- Next, add the primary key constraint.
ALTER TABLE products
ADD PRIMARY KEY (product_id);


-- Step 2: Add a DEFAULT constraint to the price column.
-- This command modifies the 'price' column to set its default value to 50.00.
-- If a new product is inserted without a specified price, it will automatically be set to 50.00.

ALTER TABLE products
MODIFY COLUMN price DECIMAL(10, 2) DEFAULT 50.00;
```

**Explanation of the Commands**
  1. Modifying product_id:
    - We first run ALTER TABLE products MODIFY COLUMN product_id INT NOT NULL; to enforce that the product_id can't be empty. This is a prerequisite for a primary key.
    - Then, ALTER TABLE products ADD PRIMARY KEY (product_id); officially designates the product_id column as the primary key, which also enforces uniqueness.
  2. Modifying price:
    - The ALTER TABLE products MODIFY COLUMN price ... DEFAULT 50.00; command alters the definition of the price column to include the DEFAULT constraint. Now, if you run an INSERT statement without providing a value for price, the database will automatically use 50.00.

(After running this script, your products table will have the required constraints to ensure better data integrity.)

In [ ]:
# -------------

**Qus 7:** You have two tables

**Students**
| student_id | student_name | class_id |
|------------|--------------|----------|
| 1          | Alice        | 101      |
| 2          | Bob          | 102      |
| 3          | Charlie      | 101      |

**Classes**
| class_id | class_name |
|----------|------------|
| 101      | Math       |
| 102      | Science    |
| 103      | History    |


Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

**Ans:**
```sql
-- This query selects the student's name and their corresponding class name
-- by joining the Students and Classes tables on their common column, class_id.

SELECT
    s.student_name,  -- Select the student_name column from the Students table
    c.class_name     -- Select the class_name column from the Classes table
FROM
    Students s       -- Start with the Students table, aliased as 's' for brevity
INNER JOIN
    Classes c        -- Join it with the Classes table, aliased as 'c'
ON
    s.class_id = c.class_id; -- The join condition: match rows where the class_id is the same in both tables

```

Explanation of the Query:

1. SELECT s.student_name, c.class_name: This specifies the columns you want to see in the final result. We are asking for the student_name from the Students table and the class_name from the Classes table. Using aliases (s and c) makes the query shorter and more readable.
2. FROM Students s: This indicates that we are starting our query from the Students table, which we've nicknamed s.
3. INNER JOIN Classes c: This tells the database to merge the Students table with the Classes table (nicknamed c).
4. ON s.class_id = c.class_id: This is the crucial join condition. It instructs the database to match a row from the Students table with a row from the Classes table only if the value in their class_id columns is identical. For example, it matches Alice (with class_id 101) to the Math class (also class_id 101).

In [ ]:
#----------------------------

**Qus 8:** Consider the following three tables:

Orders:
| order_id | order_date | customer_id |
|----------|------------|-------------|
| 1        | 2024-01-01 | 101         |
| 2        | 2024-01-03 | 102         |

Customers:
| customer_id | customer_name |
|-------------|---------------|
| 101         | Alice         |
| 102         | Bob           |

Products:
| product_id | product_name | order_id |
|------------|--------------|----------|
| 1          | Laptop       | 1        |
| 2          | Phone        | NULL     |

Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
listed even if they are not associated with an order

Hint: (use INNER JOIN and LEFT JOIN).

**Ans:**
The key to this query is realizing it's a two-step process:
  1. First, you need to connect the Orders to the Customers to get the customer's name for each order. An INNER JOIN is suitable here because an order must have a customer.
  2. Then, you need to connect the Products to this combined result. Since you want to include all products, even those without an order, a LEFT JOIN is necessary, with the Products table on the "left" side of the join.

```sql
-- This query lists all products and, where available, the corresponding
-- order ID and the name of the customer who placed the order.
-- It uses a LEFT JOIN to ensure all products are included in the result.

SELECT
    p.product_name,    -- Select the product name from the Products table
    o.order_id,        -- Select the order ID from the Orders table
    c.customer_name    -- Select the customer name from the Customers table
FROM
    Products p         -- Start with the Products table (aliased as 'p') as the base
LEFT JOIN
    Orders o           -- LEFT JOIN to the Orders table (aliased as 'o')
ON
    p.order_id = o.order_id -- The join condition between Products and Orders
LEFT JOIN
    Customers c        -- LEFT JOIN to the Customers table (aliased as 'c')
ON
    o.customer_id = c.customer_id; -- The join condition between Orders and Customers

```
Expected Output:
| product_name | order_id | customer_name |
|--------------|----------|---------------|
| Laptop       | 1        | Alice         |
| Phone        | NULL     | NULL          |


Explanation of the Query:
1. FROM Products p: We start with the Products table because our primary requirement is to list all products.
2. LEFT JOIN Orders o ON p.order_id = o.order_id: We use a LEFT JOIN to connect Products to Orders.
  - This ensures that every row from the "left" table (Products) is included in the result.
  - If a product has a matching order_id in the Orders table (like the 'Laptop'), the corresponding order information is included.
  - If a product does not have a matching order_id (like the 'Phone', which has a NULL order_id), it is still included in the result, but the columns from the Orders table (order_id) will be NULL.
3. LEFT JOIN Customers c ON o.customer_id = c.customer_id: We then join the result to the Customers table.
  - For the 'Laptop' record, which has a valid order, this join finds the matching customer_id (101) in the Customers table and retrieves the name 'Alice'.
  - For the 'Phone' record, since its order information was already NULL, there is no customer_id to join on, so the customer_name also remains NULL.

In [ ]:
# --------------

**Qus 9:** Given the following tables:

Sales
| sale_id | product_id | amount |
|---------|------------|--------|
| 1       | 101        | 500    |
| 2       | 102        | 300    |
| 3       | 101        | 700    |


Products
| product_id | product_name |
|------------|--------------|
| 101        | Laptop       |
| 102        | Phone        |


Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

**Ans:** This query involves three key components:
  1. INNER JOIN: To link sales records to product names.
  2. SUM(): An aggregate function to calculate the total sales amount.
  3. GROUP BY: To group the sales by product so SUM() calculates the total for each one.

```sql
-- This query calculates the total sales amount for each product.
-- It joins the Sales and Products tables, groups the results by product name,
-- and then sums the sales amounts for each group.

SELECT
    p.product_name,               -- Select the product's name
    SUM(s.amount) AS total_sales  -- Calculate the sum of the 'amount' and alias it as 'total_sales'
FROM
    Sales s                       -- Start with the Sales table, aliased as 's'
INNER JOIN
    Products p                    -- Join it with the Products table, aliased as 'p'
ON
    s.product_id = p.product_id   -- The join condition: match rows on their common product_id
GROUP BY
    p.product_name;               -- Group the rows by product_name so SUM() aggregates sales for each product

```
Expected Output: Based on the data in your tables, the query will produce the following result:
| product_name | total_sales |
|--------------|-------------|
| Laptop       | 1200        |
| Phone        | 300         |

Explanation of the Query:
1. INNER JOIN ... ON s.product_id = p.product_id: This first creates a temporary combined table where each sale is matched with its corresponding product name.
  - The 'Laptop' product (ID 101) appears twice.
  - The 'Phone' product (ID 102) appears once.
2. GROUP BY p.product_name: This takes the combined results and groups them into buckets, one for each unique product_name. All 'Laptop' sales go into one bucket, and all 'Phone' sales go into another.
3. SUM(s.amount): This aggregate function then calculates the sum of the amount for all rows within each group.
  - For the 'Laptop' group, it calculates 500 + 700 = 1200.
  - For the 'Phone' group, it calculates 300.
4. SELECT p.product_name, ... AS total_sales: Finally, this selects the product name for each group and the calculated sum, which is given a clear and descriptive alias, total_sales.

In [ ]:
# --------

**Qus 10:**  You are given three tables:

Orders:
| order_id | order_date | customer_id |
|----------|------------|-------------|
| 1        | 2024-01-02 | 1           |
| 2        | 2024-01-05 | 2           |

Customers:
| customer_id | customer_name |
|-------------|---------------|
| 1           | Alice         |
| 2           | Bob           |

Order_Details:
| order_id | product_id | quantity |
|----------|------------|----------|
| 1        | 101        | 2        |
| 1        | 102        | 1        |
| 2        | 101        | 3        |

Write a query to display the order_id, customer_name, and the quantity of products ordered by each
customer using an INNER JOIN between all three tables.

**Ans:** This query will first join Orders with Customers using customer_id and then join that result with Order_Details using order_id.
```sql
-- This query joins three tables to show which customer ordered what quantity of items in each order.

SELECT
    o.order_id,          -- Select the order ID from the Orders table
    c.customer_name,     -- Select the customer's name from the Customers table
    od.quantity          -- Select the quantity from the Order_Details table
FROM
    Orders o             -- Start with the Orders table, aliased as 'o'
INNER JOIN
    Customers c          -- Join to the Customers table (aliased as 'c')
ON
    o.customer_id = c.customer_id -- The join condition between Orders and Customers
INNER JOIN
    Order_Details od     -- Join the result to the Order_Details table (aliased as 'od')
ON
    o.order_id = od.order_id;      -- The join condition between the combined result and Order_Details
```

Given the data in your tables, the output of this query will be:
| order_id | customer_name | quantity |
|----------|---------------|----------|
| 1        | Alice         | 2        |
| 1        | Alice         | 1        |
| 2        | Bob           | 3        |


Explanation of the Query:
1. FROM Orders o INNER JOIN Customers c ON o.customer_id = c.customer_id: This first join creates a temporary connection between orders and customers. It matches order_id 1 with 'Alice' and order_id 2 with 'Bob'.
2. INNER JOIN Order_Details od ON o.order_id = od.order_id: This second join takes the result from the first step and connects it to the Order_Details table.
  - It finds two matching records for order_id 1, one with a quantity of 2 and another with a quantity of 1.
  - It finds one matching record for order_id 2, with a quantity of 3.
3. SELECT o.order_id, c.customer_name, od.quantity: Finally, this selects the desired columns from the fully joined data to produce the final result.

In [ ]:
# --------------------------------------

Datastructure schema:

**film:** This is a central table containing details about each movie, like title, release_year, rating, etc.

**actor:** Contains a list of actors. It's linked to the film table through the film_actor junction table.

**category:** Contains movie genres (e.g., 'Action', 'Comedy'). It's linked to the film table through the film_category junction table.

**customer:** Contains customer information. It links to the address table for location details.

**rental:** Records each time a movie is rented by a customer. It links to the inventory table to know which specific copy of a film was rented.

**payment:** Logs the payments made by customers for each rental.

**inventory:** Represents the physical copies of each film available at each store.

**store and staff:** Manage the store locations and the employees, including managers.

**Location Tables:** address, city, and country are all linked to define physical locations for customers, staff, and stores.

----

**Q1.** Identify the primary keys and foreign keys in maven movies db. Discuss the differences

**Ans:** Primary and Foreign Keys in mavenmovies

(*Here is a table identifying the keys for the main transactional tables in the database.*)
### Database Schema

| Table Name     | Primary Key(s)       | Foreign Key(s)                               | References Table(s)        |
|----------------|----------------------|-----------------------------------------------|-----------------------------|
| actor          | actor_id             | -                                             | -                           |
| film           | film_id              | language_id, original_language_id             | language                    |
| customer       | customer_id          | address_id, store_id                          | address, store              |
| staff          | staff_id             | address_id, store_id                          | address, store              |
| store          | store_id             | manager_staff_id, address_id                  | staff, address              |
| address        | address_id           | city_id                                       | city                        |
| city           | city_id              | country_id                                    | country                     |
| country        | country_id           | -                                             | -                           |
| category       | category_id          | -                                             | -                           |
| language       | language_id          | -                                             | -                           |
| inventory      | inventory_id         | film_id, store_id                             | film, store                 |
| rental         | rental_id            | inventory_id, customer_id, staff_id           | inventory, customer, staff  |
| payment        | payment_id           | customer_id, staff_id, rental_id              | customer, staff, rental     |

junction Tables:

| Table Name      | Primary Key(s)                | Foreign Key(s)              | References Table(s)   |
|-----------------|-------------------------------|-----------------------------|-----------------------|
| film_actor      | (actor_id, film_id)           | actor_id, film_id           | actor, film           |
| film_category   | (film_id, category_id)        | film_id, category_id        | film, category        |


**Discussion: The Differences Between Primary and Foreign Keys**

While both are crucial for a well-structured relational database, primary keys and foreign keys serve fundamentally different purposes.

**Primary Key (PK):** The primary key's main job is to be the unique identifier for each record in a table. It's like a Social Security Number for each row—it ensures you can pinpoint one specific record with no ambiguity.
  - Purpose: To uniquely identify a row.
  - Uniqueness: Must always be unique. No two rows in the same table can have the same primary key value.
  - Null Values: Cannot contain NULL values. Every record must have a primary key.
  - Quantity: A table can have only one primary key (though that key can be composed of multiple columns).

(*Example from mavenmovies: In the actor table, actor_id is the primary key. There is only one actor with the ID '1', one actor with the ID '2', and so on. This key allows us to uniquely identify every actor in the database.*)

**Foreign Key (FK):** The foreign key's main job is to create a link or relationship between two tables. It's a column in one table that refers to the primary key of another table. This is how you connect related data.
  - Purpose: To link two tables and enforce referential integrity.
  - Uniqueness: Can contain duplicate values. Multiple rows can refer to the same foreign key value.
  - Null Values: Can contain NULL values (unless a NOT NULL constraint is also applied). A NULL foreign key means the record is not linked to anything in the other table.
  - Quantity: A table can have multiple foreign keys, linking it to several other tables.

**Example from mavenmovies:** In the film table, language_id is a foreign key. It points to the language_id (the primary key) in the language table. Many films can have the same language_id (e.g., many films can be in English), so this column will have duplicate values. This key ensures that you can't assign a language_id to a film that doesn't exist in the language table.

In [ ]:
# ----------

**Q2.** List all details of actors

**Ans:** The SELECT * statement is used to retrieve all columns from a table.
```sql
-- This query selects all columns and all rows from the 'actor' table.
-- The asterisk (*) is a wildcard character that represents all columns.

SELECT *
FROM actor;

```
Explanation of the Query:
  - SELECT *: This is the "select all columns" statement. It tells the database you want to retrieve the data from every field (actor_id, first_name, last_name, last_update).
  - FROM actor: This specifies the table from which you want to retrieve the data, which in this case is the actor table.

In [ ]:
# ---------

**Q3.** List all customer information from DB.

**Ans:** To list all information for every customer, you need to select all columns from the customer table.
```sql
-- This query selects all columns and all rows from the 'customer' table.
-- The asterisk (*) is a wildcard that retrieves every column.

SELECT *
FROM customer;
```

Explanation of the Query:
  - SELECT *: This command specifies that you want to retrieve data from all columns available in the table.
  - FROM customer: This indicates that the data should be pulled from the table named customer.

In [ ]:
# -----

**Q4** List different countries.

**Ans:** To get a unique list of all the different countries available in the database, you need to query the country table and use the DISTINCT keyword to eliminate any duplicates.

```sql
-- This query selects a unique list of country names from the 'country' table.
-- The DISTINCT keyword ensures that each country is listed only once.

SELECT DISTINCT country
FROM country;

```
Explanation of the Query:
  - SELECT DISTINCT country: This command tells the database to retrieve the values from the country column. The DISTINCT keyword filters the results to ensure that only unique country names are returned, removing any duplicates.
  - FROM country: This specifies that the data should be pulled from the table named country.

In [ ]:
# ------

**Q5.** Display all active customers.

**Ans:** To display all active customers, you need to query the customer table and filter the results to include only those where the active column is set to 1.
```sql
-- This query selects all information for customers who are marked as active.
-- The WHERE clause filters the results to only include rows where the 'active' column has a value of 1.

SELECT *
FROM customer
WHERE active = 1;
```
Explanation of the Query:
  - SELECT *: This selects all columns for the customer records.
  - FROM customer: This specifies that you are querying the customer table.
  - WHERE active = 1: This is the crucial filtering clause. In database design, 1 is commonly used to represent a boolean TRUE or an "active" status. This line tells the database to return only the rows that meet this condition.

In [ ]:
# -------

**Q6.** List of all rental IDs for customer with ID 1.

**Ans:** To get a list of all rental IDs for the customer with an ID of 1, you need to query the rental table and filter the results using a WHERE clause.

```sql
-- This query retrieves all rental_id values from the 'rental' table
-- for the customer whose customer_id is 1.

SELECT rental_id
FROM rental
WHERE customer_id = 1;
```
Explanation of the Query:
  - SELECT rental_id: This specifies that you only want to see the rental_id column in your result.
  - FROM rental: This indicates that you are querying the rental table, which contains all the rental transaction records.
  - WHERE customer_id = 1: This is the filter. It tells the database to return only those rows where the value in the customer_id column is exactly 1.

In [ ]:
# -----

**Q7.**  Display all the films whose rental duration is greater than 5 .

**Ans:** To find all films with a rental duration longer than 5 days, you'll need to query the film table and use a WHERE clause to filter the results.
```sql
-- This query selects all information for films
-- that can be rented for more than 5 days.
-- The WHERE clause filters the 'film' table based on the 'rental_duration' column.

SELECT *
FROM film
WHERE rental_duration > 5;

```
Explanation of the Query:
  - SELECT *: This specifies that you want to retrieve all columns (like film_id, title, description, rental_duration, etc.) for the films that match the criteria.
  - FROM film: This indicates that you are querying the film table.
  - WHERE rental_duration > 5: This is the filtering condition. It instructs the database to only return rows where the value in the rental_duration column is strictly greater than 5.

In [ ]:
# ---------

**Q8.**  List the total number of films whose replacement cost is greater than $15 and less than $20.

**Ans:** To find the total number of films within a specific replacement cost range, you need to use the COUNT() function along with a WHERE clause to filter the film table.

```sql
-- This query counts the total number of films
-- whose replacement cost is strictly between $15 and $20.

SELECT
    COUNT(*) AS total_films
FROM
    film
WHERE
    replacement_cost > 15 AND replacement_cost < 20;
```

Explanation of the Query:
  - SELECT COUNT(*): This is an aggregate function that counts the total number of rows that meet the specified conditions. We've given the resulting column an alias AS total_films for clarity.
  - FROM film: This indicates that we are querying the film table.
  - WHERE replacement_cost > 15 AND replacement_cost < 20: This clause filters the films to include only those whose replacement_cost is greater than 15 AND less than 20.

In [ ]:
# --------

**Q9.**  Display the count of unique first names of actors

**Ans:** To count how many different (unique) first names exist in the actor table, you need to use the COUNT() function combined with the DISTINCT keyword.

This combination ensures that you are counting each unique name only once, regardless of how many times it appears in the table.

```sql
-- This query counts the number of unique first names present in the 'actor' table.
-- COUNT(DISTINCT column_name) is used to count only the unique occurrences.

SELECT
    COUNT(DISTINCT first_name) AS unique_first_name_count
FROM
    actor;

```
Explanation of the Query:
  - SELECT COUNT(DISTINCT first_name): This is the core of the query.
  - DISTINCT first_name: This part first creates a temporary list of all the first names where each name appears only once.
  - COUNT(...): This function then counts the number of items in that unique list.
  - AS unique_first_name_count: This gives a clear, descriptive name to the resulting column in the output.
  - FROM actor: This specifies that the operation should be performed on the actor table.

In [ ]:
# ----------

**Q10.**  Display the first 10 records from the customer table .

**Ans:**

**Q11.**  Display the first 3 records from the customer table whose first name starts with ‘b

**Ans:** To display the first three records of customers whose first name begins with 'b', you need to filter the customer table with a WHERE clause and then restrict the number of results using the LIMIT clause.
```sql
-- This query retrieves the first 3 records from the 'customer' table
-- for customers whose first name starts with the letter 'b'.

SELECT *
FROM customer
WHERE first_name LIKE 'b%'
LIMIT 3;
```

Explanation of the Query:
  - SELECT *: This selects all columns for the customer records that match the filter.
  - FROM customer: This specifies that you are querying the customer table.
  - WHERE first_name LIKE 'b%': This is the filtering clause.
  - The LIKE operator is used for pattern matching in strings.
  - The pattern 'b%' tells the database to find any value in the first_name column that starts with the letter 'b', followed by any sequence of zero or more characters.
  - LIMIT 3: This clause restricts the output to the first 3 rows that are returned after the WHERE clause is applied.

**Q12.** Display the names of the first 5 movies which are rated as ‘G’.

**Ans:** To get the names of the first 5 movies with a 'G' rating, you need to query the film table, filter by the rating column, and then use the LIMIT clause to restrict the output.

```sql
-- This query retrieves the titles of the first 5 films
-- that have a rating of 'G'.

SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;
```

Explanation of the Query:
  - SELECT title: This specifies that you only want to see the title column in the final result.
  - FROM film: This indicates that you are querying the film table.
  - WHERE rating = 'G': This is the filtering condition. It tells the database to only consider rows where the value in the rating column is exactly 'G'.
  - LIMIT 5: This clause is applied after the filtering and tells the database to stop after finding the first 5 matching records.

**Q13.** Find all customers whose first name starts with "a".

**Ans:** To find all customers whose first name starts with the letter 'a', you need to query the customer table and use the LIKE operator for pattern matching.

```sql
-- This query finds all customers whose first name starts with the letter 'a'.
-- The '%' is a wildcard character that matches any sequence of characters.

SELECT *
FROM customer
WHERE first_name LIKE 'a%';
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the customer records.
  - FROM customer: This specifies that the data should be retrieved from the customer table.
  - WHERE first_name LIKE 'a%': This is the filtering clause that finds the customers.
  - The LIKE operator is used to search for a specified pattern in a column.
  - The pattern 'a%' tells the database to find any value that starts with a lowercase 'a' followed by any number of characters. Most SQL systems perform case-insensitive searches by default, so this will also match 'A'.

**Q14.** Find all customers whose first name ends with "a".

**Ans:** To find all customers whose first name ends with the letter "a", you need to use the LIKE operator with a wildcard % at the beginning of the pattern.

```sql
-- This query finds all customers whose first name ends with the letter 'a'.
-- The '%' wildcard at the beginning of the pattern matches any sequence of characters.

SELECT *
FROM customer
WHERE first_name LIKE '%a';
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the customer records.
  - FROM customer: This specifies that the data should be retrieved from the customer table.
  - WHERE first_name LIKE '%a': This is the filtering clause.
  - The LIKE operator is used to search for a specified pattern in a column.
  - The pattern '%a' tells the database to find any value that has any number of characters (%) followed immediately by the letter 'a'. This effectively finds all names ending with 'a'.

**Q15.** Display the list of first 4 cities which start and end with ‘a’ .

**Ans:** To get a list of the first 4 cities that both start and end with the letter 'a', you need to combine two LIKE conditions with an AND operator and then use LIMIT.

```sql
-- This query retrieves the names of the first 4 cities
-- that start with the letter 'a' AND end with the letter 'a'.

SELECT city
FROM city
WHERE city LIKE 'a%' AND city LIKE '%a'
LIMIT 4;
```

Explanation of the Query:
  - SELECT city: This specifies that you only want to see the city column in the result.
  - FROM city: This indicates that you are querying the city table.
  - WHERE city LIKE 'a%' AND city LIKE '%a': This is the filtering clause with two conditions joined by AND:
  - city LIKE 'a%': Finds cities that start with 'a'.
  - city LIKE '%a': Finds cities that end with 'a'.
  - The AND operator ensures that only cities satisfying both conditions are returned.
  - LIMIT 4: This clause restricts the output to the first 4 matching records found.

**Q16.** Find all customers whose first name have "NI" in any position.

**Ans:** To find all customers whose first name contains "NI" in any position, you need to use the LIKE operator with wildcards (%) on both sides of the search string.

```sql
-- This query finds all customers whose first name contains the substring "NI".
-- The '%' wildcards on both sides of 'NI' match any sequence of characters.

SELECT *
FROM customer
WHERE first_name LIKE '%NI%';
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the customer records.
  - FROM customer: This specifies that the data should be retrieved from the customer table.
  - WHERE first_name LIKE '%NI%': This is the filtering clause.
  - The LIKE operator is used to search for a specified pattern in a column.
  - The pattern '%NI%' tells the database to find any value that contains the sequence 'NI' anywhere within it. The % before 'NI' matches any characters at the beginning of the name, and the % after 'NI' matches any characters at the end.

**Q17.** Find all customers whose first name have "r" in the second position .

**Ans:** To find all customers whose first name has the letter 'r' in the second position, you need to use the LIKE operator with the underscore (_) wildcard.

```sql
-- This query finds all customers whose first name has 'r' as the second letter.
-- The underscore '_' is a wildcard that matches any single character.

SELECT *
FROM customer
WHERE first_name LIKE '_r%';
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the customer records.
  - FROM customer: This specifies that you are querying the customer table.
  - WHERE first_name LIKE '_r%': This is the filtering clause that finds the specific pattern.
  - The _ (underscore) wildcard matches exactly one single character.
  - The % (percent sign) wildcard matches any sequence of zero or more characters.
  - Therefore, the pattern '_r%' finds any name that starts with any single character, is immediately followed by the letter 'r', and then is followed by any other characters.

**Q18.** Find all customers whose first name starts with "a" and are at least 5 characters in length.

**Ans:** To find all customers whose first name starts with "a" and is also at least five characters long, you need a WHERE clause with two conditions combined by the AND operator.

```sql
-- This query finds all customers whose first name starts with 'a'
-- AND has a length of 5 or more characters.

SELECT *
FROM customer
WHERE
    first_name LIKE 'a%'
    AND LENGTH(first_name) >= 5;
```

Explanation of the Query:
  - SELECT *: This command selects all available columns for the customers.
  - FROM customer: This specifies that you are querying the customer table.
  - WHERE first_name LIKE 'a%' AND LENGTH(first_name) >= 5: This is the filtering clause that contains two conditions:
  - first_name LIKE 'a%': This part ensures the customer's first name starts with the letter 'a'.
  - AND: This logical operator requires that both conditions must be true for a row to be included in the result.
  - LENGTH(first_name) >= 5: This part uses the LENGTH() function to calculate the number of characters in the first_name and ensures that the count is greater than or equal to 5.

**Q19.** Find all customers whose first name starts with "a" and ends with "o".

**Ans:** To find all customers whose first name both starts with 'a' and ends with 'o', you can combine the patterns within a single LIKE operator.

```sql
-- This query finds all customers whose first name starts with 'a' and ends with 'o'.
-- The pattern 'a%o' matches any string that begins with 'a',
-- has any characters in the middle, and finishes with 'o'.

SELECT *
FROM customer
WHERE first_name LIKE 'a%o';
```

Explanation of the Query:
  - SELECT *: This selects all columns for the customer records that match the filter.
  - FROM customer: This specifies that you are querying the customer table.
  - WHERE first_name LIKE 'a%o': This is the filtering clause.
  - 'a%o' is a powerful pattern that combines two conditions:
  - a: The name must start with the letter 'a'.
  - %: The percent sign is a wildcard that matches any sequence of zero or more characters in the middle.
  - o: The name must end with the letter 'o'.

**Q20.** Get the films with pg and pg-13 rating using IN operator.

**Ans:** To get all films that are rated either 'PG' or 'PG-13', you can use the IN operator to specify both ratings in the WHERE clause.

```sql
-- This query selects all information for films that have a rating of either 'PG' or 'PG-13'.
-- The IN operator is used to specify a list of possible values for the 'rating' column.

SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the films that match the filter.
  - FROM film: This specifies that you are querying the film table.
  - WHERE rating IN ('PG', 'PG-13'): This is the filtering clause.
  - The IN operator allows you to provide a list of values.
  - The query will return any row where the value in the rating column matches any one of the values inside the parentheses ('PG' or 'PG-13'). It's a more concise way of writing WHERE rating = 'PG' OR rating = 'PG-13'.

**Q21.** Get the films with length between 50 to 100 using between operator.

**Ans:** To get all films with a length between 50 and 100 minutes, you should use the BETWEEN operator in your WHERE

```sql
-- This query selects all information for films with a length
-- between 50 and 100 minutes, inclusive.

SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the films that match the filter.
  - FROM film: This specifies that you are querying the film table.
  - WHERE length BETWEEN 50 AND 100: This is the filtering clause.
  - The BETWEEN operator is used to select values within a given range.
  - It is inclusive, meaning it will include films with a length of exactly 50 and exactly 100 minutes, as well as everything in between. It's equivalent to writing WHERE length >= 50 AND length <= 100.

**Q22.** Get the top 50 actors using limit operator.

**Ans:** To get the top 50 actors from the database, you simply need to select from the actor table and use the LIMIT operator to restrict the number of rows returned.

```sql
-- This query retrieves the first 50 records from the 'actor' table.
-- The LIMIT clause is used to restrict the number of rows returned.

SELECT *
FROM actor
LIMIT 50;
```

Explanation of the Query:
  - SELECT *: This command selects all columns for the actor records.
  - FROM actor: This specifies that you are querying the actor table.
  - LIMIT 50: This is a crucial clause that tells the database to stop processing and return the result set after it has found 50 rows. Without an ORDER BY clause, the "top 50" will be the first 50 actors as they are stored in the database, which is typically by actor_id.

**Q23.** Get the distinct film ids from inventory table.

**Ans:** To get a distinct list of film IDs from the inventory table, you need to select the film_id column and use the DISTINCT keyword to remove duplicate entries.

This is useful because the inventory table lists every single copy of a film, so a popular film might appear many times. DISTINCT ensures you see each film_id only once.

```sql
-- This query retrieves a unique list of all film_id values
-- present in the 'inventory' table.

SELECT DISTINCT film_id
FROM inventory;
```

Explanation of the Query:
  - SELECT DISTINCT film_id: This command tells the database to retrieve the values from the film_id column. The DISTINCT keyword filters this list to ensure that each unique film_id is returned only one time, no matter how many copies of that film exist in the inventory.
  - FROM inventory: This specifies that the data should be pulled from the inventory table.

###Functions
**Basic Aggregate Functions:**

**Question 1:** Retrieve the total number of rentals made in the Sakila database.

(*Hint: Use the COUNT() function.*)

**Ans:** To retrieve the total number of rentals, you need to count all the rows in the rental table using the COUNT() function.
```sql
-- This query counts the total number of records in the 'rental' table
-- to find the total number of rentals made.

SELECT
    COUNT(*) AS total_rentals
FROM
    rental;
```

Explanation of the Query:
  - SELECT COUNT(*): This is the core of the query. The COUNT() function is an aggregate function that counts the number of rows. The asterisk (*) is a wildcard that tells the function to count every single row in the table, regardless of column values.
  - AS total_rentals: This is an alias, which gives a temporary, descriptive name to the result column.
  - FROM rental: This specifies that the counting should be performed on the rental table.

**Question 2:** Find the average rental duration (in days) of movies rented from the Sakila database.

(*Hint: Utilize the AVG() function.*)

**Ans:** To find the average rental duration of movies, you need to use the AVG() function on the rental_duration column in the film table.

```sql
-- This query calculates the average rental duration for all films
-- in the 'film' table.

SELECT
    AVG(rental_duration) AS average_rental_duration
FROM
    film;
```

Explanation of the Query:
  - SELECT AVG(rental_duration): This command uses the AVG() aggregate function to calculate the average value of all entries in the rental_duration column.
  - AS average_rental_duration: This is an alias that gives a clean, readable name to the resulting column.
  - FROM film: This specifies that the calculation should be performed on the film table.

**Question 3:** Display the first name and last name of customers in uppercase.

(*Hint: Use the UPPER () function.*)

**Ans:** To display the first and last names of all customers in uppercase, you need to apply the UPPER() function to the first_name and last_name columns.

```sql
-- This query retrieves the first name and last name of each customer
-- and converts them to uppercase using the UPPER() function.

SELECT
    UPPER(first_name) AS upper_first_name,
    UPPER(last_name) AS upper_last_name
FROM
    customer;
```

Explanation of the Query:
  - SELECT UPPER(first_name) AS upper_first_name, UPPER(last_name) AS upper_last_name: This command selects two columns.
  - The UPPER() function is applied to both the first_name and last_name columns, which converts all characters in those fields to their uppercase form.
  - AS is used to create a clear alias for each new column.
  - FROM customer: This specifies that the data should be retrieved from the customer table.

**Question 4:** Extract the month from the rental date and display it alongside the rental ID.

(*Hint: Employ the MONTH() function.*)

**Ans:** To extract the month from the rental_date for each rental, you can use the MONTH() function on the rental_date column.
```sql
-- This query retrieves the rental ID and extracts the month
-- from the rental_date column for each rental.

SELECT
    rental_id,
    MONTH(rental_date) AS rental_month
FROM
    rental;
```

Explanation of the Query:
  - SELECT rental_id, MONTH(rental_date) AS rental_month: This command selects two columns:
  - rental_id: The unique identifier for the rental.
  - MONTH(rental_date): The MONTH() function is a date function that takes a date or datetime value (in this case, rental_date) and returns the month as an integer (from 1 for January to 12 for December).
  - AS rental_month: This gives a clear and descriptive name to the new column containing the extracted month.
  - FROM rental: This specifies that the data should be retrieved from the rental table.

###GROUP BY:

**Question 5:** Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

(*Hint: Use COUNT () in conjunction with GROUP BY.*)

**Ans:** To get the total number of rentals for each customer, you need to count the rentals and then group them by the customer_id.

```sql
-- This query counts the number of rentals made by each customer.
-- It groups the rows by customer_id and then counts the rentals within each group.

SELECT
    customer_id,
    COUNT(rental_id) AS rental_count
FROM
    rental
GROUP BY
    customer_id
ORDER BY
    rental_count DESC; -- Optional: Orders the result to show customers with the most rentals first.
```

Explanation of the Query:
  - SELECT customer_id, COUNT(rental_id) AS rental_count: This selects the customer_id and then uses the COUNT() function to count the number of rental_ids for each customer. The result of the count is given the alias rental_count.
  - FROM rental: This specifies that you are querying the rental table.
  - GROUP BY customer_id: This is the key part of the query. It groups all the rows with the same customer_id into a single summary row. The COUNT() function then operates on each of these groups individually.
  - ORDER BY rental_count DESC: This optional clause sorts the results in descending order, so you can easily see which customers have rented the most movies.

**Question 6:** Find the total revenue generated by each store.

(*Hint: Combine SUM() and GROUP BY.*)

**Ans:** To calculate the total revenue generated by each store, you'll need to join multiple tables to link payments to their respective stores and then use SUM() with GROUP BY.

The logical path is: payment → rental → inventory → store.

```sql
-- This query calculates the total revenue for each store.
-- It joins the payment, rental, inventory, and store tables to link each payment
-- to a store, then groups by the store_id to sum the revenue.

SELECT
    s.store_id,
    SUM(p.amount) AS total_revenue
FROM
    payment p
INNER JOIN
    rental r ON p.rental_id = r.rental_id
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    store s ON i.store_id = s.store_id
GROUP BY
    s.store_id;
```

Explanation of the Query:
  - SELECT s.store_id, SUM(p.amount) AS total_revenue: This selects the store_id to identify each store and uses the SUM() function on the amount column from the payment table to calculate the total revenue. The result is aliased as total_revenue.
  - FROM payment p: The query starts with the payment table, which contains the revenue data.
  - INNER JOIN ...: Three INNER JOIN clauses are used to connect the tables:
  - payment is joined with rental on rental_id.
  - rental is joined with inventory on inventory_id.
  - inventory is joined with store on store_id. This final join successfully links each payment to a specific store.
  - GROUP BY s.store_id: This crucial clause groups all the payments by their store_id. The SUM() function then calculates the total revenue for each of these distinct store groups.

**Question 7:** Determine the total number of rentals for each category of movies.

(*Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.*)

**Ans:** To determine the total number of rentals for each movie category, you need to join the tables that link categories to films and films to rentals, then aggregate the results.

The logical path is: category → film_category → inventory → rental.

```sql
-- This query calculates the total number of rentals for each movie category.
-- It joins the necessary tables to link categories to rentals,
-- then groups by the category name to count the rentals in each group.

SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS rental_count
FROM
    category c
INNER JOIN
    film_category fc ON c.category_id = fc.category_id
INNER JOIN
    inventory i ON fc.film_id = i.film_id
INNER JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    rental_count DESC; -- Optional: Orders the results to show the most popular categories first.
```

Explanation of the Query:
  - SELECT c.name AS category_name, COUNT(r.rental_id) AS rental_count: This selects the category name and uses COUNT() on rental_id to count every rental transaction. The columns are aliased for clarity.
  - FROM category c: The query starts from the category table.
  - INNER JOIN ...: A series of INNER JOINs connects the tables:
  - category is linked to film_category by category_id.
  - film_category is linked to inventory by film_id.
  - inventory is linked to rental by inventory_id. This successfully connects each rental to its film's category.
  - GROUP BY c.name: This crucial clause groups all the rentals by their category name. The COUNT() function then calculates the total for each distinct category.
  - ORDER BY rental_count DESC: This optional clause sorts the results to easily see which categories are the most rented.

**Question 8:** Find the average rental rate of movies in each language.

(*Hint: JOIN film and language tables, then use AVG () and GROUP BY.*)

**Ans:** To find the average rental rate for movies in each language, you need to join the film and language tables, and then use the AVG() function with GROUP BY.

```sql
-- This query calculates the average rental rate for films, grouped by their language.
-- It joins the film and language tables to get the name of each language.

SELECT
    l.name AS language,
    AVG(f.rental_rate) AS average_rental_rate
FROM
    film f
INNER JOIN
    language l ON f.language_id = l.language_id
GROUP BY
    l.name
ORDER BY
    average_rental_rate DESC; -- Optional: Orders the results to show languages with the highest average rate first.
```

Explanation of the Query:
  - SELECT l.name AS language, AVG(f.rental_rate) AS average_rental_rate: This selects the language name from the language table and calculates the average of the rental_rate from the film table. Both columns are given clear aliases.
  - FROM film f INNER JOIN language l ON f.language_id = l.language_id: This joins the film table with the language table on their common language_id column, allowing you to associate each film with its language's name.
  - GROUP BY l.name: This clause groups all the films by their language name. The AVG() function then calculates the average rental rate for all films within each distinct language group.

###Joins

**Question 9:** Display the title of the movie, customer s first name, and last name who rented it.

(*Hint: Use JOIN between the film, inventory, rental, and customer tables.*)

**Ans:** To display the movie title along with the first and last name of the customer who rented it, you need to join four tables together: customer, rental, inventory, and film.

```sql
-- This query retrieves the movie title and the full name of the customer who rented it.
-- It requires joining four tables to connect customers to the films they rented.

SELECT
    f.title,
    c.first_name,
    c.last_name
FROM
    rental r
INNER JOIN
    customer c ON r.customer_id = c.customer_id
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    film f ON i.film_id = f.film_id
ORDER BY
    r.rental_date DESC -- Optional: Shows the most recent rentals first.
LIMIT 10; -- Optional: Limits the output to a manageable number for display.
```

Explanation of the Query:
  - SELECT f.title, c.first_name, c.last_name: This specifies the three columns you want to display: the movie's title, and the customer's first and last names.
  - FROM rental r: The query starts from the rental table as it is the central link between customers and the film inventory.
  - INNER JOIN ...: A series of INNER JOINs are used to connect the tables:
  - rental is joined with customer on customer_id to get the customer's name.
  - rental is then joined with inventory on inventory_id to find out which specific copy of a film was rented.
  - Finally, inventory is joined with film on film_id to get the title of that film.
  - ORDER BY and LIMIT: These optional clauses are added to make the output more readable by showing the 10 most recent rentals.

**Question 10:** Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

(*Hint: Use JOIN between the film actor, film, and actor tables.*)

**Ans:** To get the names of all actors who appeared in the film "Gone with the Wind," you need to join the actor, film_actor, and film tables.

```sql
-- This query retrieves the first and last names of all actors
-- who have appeared in the film titled 'Gone with the Wind'.

SELECT
    a.first_name,
    a.last_name
FROM
    actor a
INNER JOIN
    film_actor fa ON a.actor_id = fa.actor_id
INNER JOIN
    film f ON fa.film_id = f.film_id
WHERE
    f.title = 'Gone with the Wind';
```

Explanation of the Query:
  - SELECT a.first_name, a.last_name: This specifies that you want to retrieve the first and last names from the actor table.
  - FROM actor a: The query starts with the actor table.
  - INNER JOIN ...: Two INNER JOINs are used to create the link:
  - The actor table is joined with the film_actor junction table on actor_id.
  - The result is then joined with the film table on film_id.
  - WHERE f.title = 'Gone with the Wind': This crucial clause filters the massive joined table to include only the records associated with the film titled "Gone with the Wind".

**Question 11:** Retrieve the customer names along with the total amount they've spent on rentals.

(*Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.*)

**Ans:** To get the total amount each customer has spent, you need to join the customer and payment tables and then group the results by customer to sum their payments.

(Note: While the hint mentions the rental table, a more direct join between customer and payment is sufficient, as the payment table already includes the customer_id.)

```sql
-- This query calculates the total amount of money each customer has spent on rentals.
-- It joins the customer and payment tables, then groups by customer to sum their payments.

SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent
FROM
    customer c
INNER JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC; -- Optional: Orders the results to show the highest-spending customers first.
```

Explanation of the Query:
  - SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent: This selects the customer's full name and uses the SUM() function on the amount column to calculate their total spending. The result is given the alias total_spent.
  - FROM customer c INNER JOIN payment p ON c.customer_id = p.customer_id: This joins the customer table with the payment table on their common customer_id. This links every payment to the customer who made it.
  - GROUP BY c.customer_id, c.first_name, c.last_name: This crucial clause groups all payments made by the same customer. The SUM() function then calculates the total for each individual customer group.
  - ORDER BY total_spent DESC: This optional clause sorts the results to list the top-spending customers first, which is often the most useful view.

**Question 12:** List the titles of movies rented by each customer in a particular city (e.g., 'London').

(*Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.*)

**Ans:** To get a list of movie titles rented by each customer in a specific city like 'London', you need to perform a multi-table join and then use GROUP_CONCAT() to aggregate the titles for each customer.

```sql
-- This query lists each customer in London and all the movie titles they have rented.
-- It requires joining six tables to connect customers in a specific city to the films they rented.

SELECT
    c.first_name,
    c.last_name,
    GROUP_CONCAT(f.title SEPARATOR '; ') AS rented_movies
FROM
    customer c
INNER JOIN
    address a ON c.address_id = a.address_id
INNER JOIN
    city ci ON a.city_id = ci.city_id
INNER JOIN
    rental r ON c.customer_id = r.customer_id
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    film f ON i.film_id = f.film_id
WHERE
    ci.city = 'London'
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    c.first_name;
```

Explanation of the Query:
  - SELECT c.first_name, c.last_name, GROUP_CONCAT(f.title SEPARATOR '; ') AS rented_movies:
    - This selects the customer's name.
    - GROUP_CONCAT(f.title SEPARATOR '; ') is an aggregate function that takes all the movie titles belonging to a customer (after grouping) and combines them into a single string, separated by a semicolon and a space.
  - FROM customer c and INNER JOIN ...: This section links all six tables together:
    1. customer is joined to address to find where the customer lives.
    2. address is joined to city to get the city name.
    3. customer is joined to rental to find their rentals.
    4. rental is joined to inventory to find which film copy was rented.
    5. inventory is joined to film to get the movie's title.
  - WHERE ci.city = 'London': This filters the entire joined result to include only records for customers who live in 'London'.
  - GROUP BY c.customer_id, c.first_name, c.last_name: This groups all the rows by customer, so that GROUP_CONCAT() can aggregate all the rented movie titles for each unique customer.

### Advanced Joins and GROUP BY:

**Question 13:** Display the top 5 rented movies along with the number of times they've been rented.

(*Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.*)

**Ans:** To determine the top 5 most rented movies, you need to count the number of rentals for each film and then select the highest counts. This requires joining the tables that connect a rental transaction to a specific film title.

```sql
-- This query identifies the top 5 most rented movies by counting
-- the number of rental records associated with each film.

SELECT
    f.title,
    COUNT(r.rental_id) AS rental_count
FROM
    rental r
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    film f ON i.film_id = f.film_id
GROUP BY
    f.title
ORDER BY
    rental_count DESC
LIMIT 5;

```

Explanation of the Query:
  - SELECT f.title, COUNT(r.rental_id) AS rental_count: This selects the film's title and uses COUNT() to count every rental associated with it. The count is given the clear alias rental_count.
  - FROM rental r and INNER JOIN ...:
    1. The query starts with the rental table, which contains the transaction data.
    2. It's joined to inventory on inventory_id to identify which film copy was rented.
    3. That is then joined to film on film_id to get the actual title of the movie.
  - GROUP BY f.title: This is a crucial step that groups all rental records by the movie title, ensuring that the COUNT() function aggregates the total rentals for each individual movie.
  - ORDER BY rental_count DESC: This sorts the grouped results from the highest rental count to the lowest.
  - LIMIT 5: This final clause restricts the output to only the top 5 rows from the sorted result set.

**Question 14:** Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

(*Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.*)

**Ans:** To find customers who have rented from both Store 1 and Store 2, you need to identify which unique stores each customer has rented from and then filter for those who have rented from exactly two different stores.
```sql
-- This query identifies customers who have rented movies from both store 1 and store 2.
-- It works by counting the number of distinct stores each customer has rented from
-- and then filtering for those where the count is 2.

SELECT
    c.first_name,
    c.last_name
FROM
    customer c
INNER JOIN
    rental r ON c.customer_id = r.customer_id
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(DISTINCT i.store_id) = 2;
```

Explanation of the Query:
  - SELECT c.first_name, c.last_name: This selects the names of the customers who meet the criteria.
  - FROM customer c and INNER JOIN ...:
    1. The query starts with the customer table.
    2. It's joined to rental to find all of a customer's rental transactions.
    3. That result is then joined to inventory to find out which store_id each rental belongs to.
  - GROUP BY c.customer_id, c.first_name, c.last_name: This groups all the rental records by customer.
  - HAVING COUNT(DISTINCT i.store_id) = 2: This is the key filtering step that happens after grouping.
    - COUNT(DISTINCT i.store_id): For each customer group, this counts the number of unique store IDs they have rented from.
    - =2 :The HAVING clause then filters these groups, keeping only those customers for whom the distinct store count is exactly 2. Since there are only two stores in the database, this effectively finds the customers who have rented from both.

### Windows Function:

***Question 1:** Rank the customers based on the total amount they've spent on rentals.

**Ans:** To rank customers based on the total amount they've spent, you first need to calculate the total for each customer and then apply the RANK() window function to that result.

A Common Table Expression (CTE) is a clean way to structure this query.

```sql
-- This query ranks customers based on their total rental spending.
-- It first calculates the total amount spent by each customer in a CTE,
-- then uses the RANK() window function to assign a rank based on that total.

WITH CustomerSpending AS (
    -- First, calculate the total amount spent by each customer
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM
        customer c
    INNER JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
)
-- Now, select from the CTE and apply the RANK() function
SELECT
    first_name,
    last_name,
    total_spent,
    RANK() OVER (ORDER BY total_spent DESC) AS customer_rank
FROM
    CustomerSpending;
```

Explanation of the Query:
  - WITH CustomerSpending AS (...): This defines a Common Table Expression (CTE), which is like a temporary, named result set.
    - Inside the CTE, we join customer and payment and use SUM(p.amount) with GROUP BY to calculate the total_spent for each customer.
  - SELECT ... FROM CustomerSpending: This is the final SELECT statement that operates on our temporary CustomerSpending table.
  - RANK() OVER (ORDER BY total_spent DESC) AS customer_rank: This is the window function.
    - RANK(): This function assigns a rank to each row. It gives the same rank to rows with the same value (a "tie"), and skips the next rank(s) accordingly.
    - OVER (...): This clause defines the "window" or the set of rows the function works on.
    - ORDER BY total_spent DESC: This tells the RANK() function to order the customers by their total_spent in descending order (highest spender first) before assigning ranks.

***Question 2:**  Calculate the cumulative revenue generated by each film over time.

**Ans:** To calculate the cumulative revenue (a running total) for each film over time, you need to use the SUM() window function. This function can calculate a sum over a "window" of rows that are related to the current row.

```sql
-- This query calculates a running total of revenue for each film, ordered by payment date.
-- It uses a window function to partition the data by film title and order it by time.

SELECT
    f.title,
    p.payment_date,
    p.amount,
    SUM(p.amount) OVER (PARTITION BY f.title ORDER BY p.payment_date) AS cumulative_revenue
FROM
    payment p
INNER JOIN
    rental r ON p.rental_id = r.rental_id
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    film f ON i.film_id = f.film_id
ORDER BY
    f.title, p.payment_date;
```

Explanation of the Query:
  - SELECT f.title, p.payment_date, p.amount, ...: This selects the basic information we want to see: the film title, the date of the payment, and the amount of that specific payment.
  - SUM(p.amount) OVER (PARTITION BY f.title ORDER BY p.payment_date) AS cumulative_revenue: This is the window function that does the main work.
    - SUM(p.amount): Specifies that we want to sum the amount column.
    - OVER (...): This clause defines the "window" for the function.
    - PARTITION BY f.title: This breaks the data into separate partitions, one for each unique film title. The SUM() will restart its calculation for each new film.
    - ORDER BY p.payment_date: Within each partition (for each film), this orders the rows by the payment date. This is what makes the sum cumulative—it sums the current row's amount with all the preceding rows' amounts for that film.
  - FROM payment p and INNER JOIN ...: This series of joins connects each payment to its corresponding film title through the rental and inventory tables.
  - ORDER BY f.title, p.payment_date: This final clause organizes the entire output so you can easily follow the cumulative calculation for each film.

***Question 3:**  Determine the average rental duration for each film, considering films with similar lengths.

**Ans:** To determine the average rental duration for films with similar lengths, we first need to categorize the films into groups based on their length (e.g., 'Short', 'Medium', 'Long'). We can achieve this using a CASE statement, and then GROUP BY these new categories to calculate the average.

```sql
-- This query calculates the average rental duration for films grouped into categories
-- based on their length ('Short', 'Medium', 'Long').

SELECT
    CASE
        WHEN length < 60 THEN 'Short'
        WHEN length BETWEEN 60 AND 120 THEN 'Medium'
        ELSE 'Long'
    END AS length_category,
    AVG(rental_duration) AS average_rental_duration
FROM
    film
GROUP BY
    length_category
ORDER BY
    length_category;
```

Explanation of the Query:
  - SELECT CASE ... END AS length_category, AVG(rental_duration) ...: This part of the query does two things:
    - CASE WHEN ... END AS length_category: This creates a new temporary column named length_category. It checks the length of each film and assigns it to a category: 'Short' if less than 60 minutes, 'Medium' if between 60 and 120 minutes, and 'Long' if over 120 minutes.
    - AVG(rental_duration) AS average_rental_duration: This calculates the average rental_duration for the films.
  - FROM film: This specifies that the data comes from the film table.
  - GROUP BY length_category: This is the key step. It groups all the films based on the new length_category we created. The AVG() function then calculates the average rental duration for each of these distinct groups ('Short', 'Medium', 'Long').

***Question 4:**  Identify the top 3 films in each category based on their rental counts.

**Ans:** To identify the top 3 rented films in each category, you need to first count the rentals for each film, then rank them within their category using a window function, and finally filter for the top 3 ranks.

Using Common Table Expressions (CTEs) makes this multi-step process clean and easy to read.

```sql
-- This query identifies the top 3 most-rented films within each category.
-- It uses two CTEs: one to count rentals per film, and a second to rank films within their category.

WITH FilmRentalCounts AS (
    -- First, count the total rentals for each film
    SELECT
        f.film_id,
        f.title,
        COUNT(r.rental_id) AS rental_count
    FROM
        rental r
    INNER JOIN inventory i ON r.inventory_id = i.inventory_id
    INNER JOIN film f ON i.film_id = f.film_id
    GROUP BY
        f.film_id, f.title
),
RankedFilms AS (
    -- Next, join with categories and rank the films within each category
    SELECT
        c.name AS category_name,
        frc.title,
        frc.rental_count,
        RANK() OVER (PARTITION BY c.name ORDER BY frc.rental_count DESC) AS film_rank
    FROM
        FilmRentalCounts frc
    INNER JOIN film_category fc ON frc.film_id = fc.film_id
    INNER JOIN category c ON fc.category_id = c.category_id
)
-- Finally, select the top 3 ranked films from each category
SELECT
    category_name,
    title,
    rental_count,
    film_rank
FROM
    RankedFilms
WHERE
    film_rank <= 3
ORDER BY
    category_name, film_rank;
```

Explanation of the Query:
  1. WITH FilmRentalCounts AS (...): The first CTE calculates the total rental_count for every single film by joining the film, inventory, and rental tables.
  2. WITH RankedFilms AS (...): The second CTE takes the rental counts from the first CTE and adds the category information by joining to film_category and category. Then, it applies the crucial window function:
    - RANK() OVER (PARTITION BY c.name ORDER BY frc.rental_count DESC) AS film_rank:
      - PARTITION BY c.name: This divides the data into separate "windows," one for each category (e.g., 'Action', 'Comedy', 'Drama'). The ranking function restarts for each new category.
      - ORDER BY frc.rental_count DESC: Within each category partition, it orders the films from the highest rental count to the lowest.
      - RANK(): Assigns a rank based on this order.
  3. SELECT ... FROM RankedFilms WHERE film_rank <= 3: The final SELECT statement queries the result of the RankedFilms CTE and filters it to show only the rows where the film_rank is 1, 2, or 3.

***Question 5:**  Calculate the difference in rental counts between each customer's total rentals and the average rentals

across all customers.

**Ans:** To calculate the difference between each customer's total rentals and the average rental count across all customers, you'll need a multi-step query. Using Common Table Expressions (CTEs) is an excellent way to break down the problem.

  1. First, calculate the rental count for each customer.
  2. Second, calculate the overall average of those counts.
  3. Finally, subtract the average from each customer's individual count.

```sql
-- This query calculates the difference between each customer's total rental count
-- and the average rental count across all customers.

WITH CustomerRentalCounts AS (
    -- Step 1: Count the number of rentals for each customer
    SELECT
        customer_id,
        COUNT(rental_id) AS rental_count
    FROM
        rental
    GROUP BY
        customer_id
),
AverageRentals AS (
    -- Step 2: Calculate the single average rental value from the counts above
    SELECT
        AVG(rental_count) AS avg_rental_count
    FROM
        CustomerRentalCounts
)
-- Step 3: Join the tables and calculate the difference
SELECT
    c.first_name,
    c.last_name,
    crc.rental_count,
    (crc.rental_count - ar.avg_rental_count) AS difference_from_average
FROM
    CustomerRentalCounts crc
JOIN
    customer c ON crc.customer_id = c.customer_id
CROSS JOIN
    AverageRentals ar -- Join with the average value
ORDER BY
    difference_from_average DESC;
```

Explanation of the Query:
  - WITH CustomerRentalCounts AS (...): The first CTE creates a temporary table that lists each customer_id and their total number of rentals (rental_count).
  - WITH AverageRentals AS (...): The second CTE calculates a single value: the average of all the rental counts from the first CTE. This gives us the overall average rentals per customer.
  - Final SELECT Statement:
    - It retrieves the customer's name by joining CustomerRentalCounts with the customer table.
    - It uses CROSS JOIN AverageRentals to make the single average value available to every row.
    - The calculation (crc.rental_count - ar.avg_rental_count) is then performed for each customer, showing how their rental habits compare to the average.
    - The results are ordered to show the customers with the highest positive difference first.

***Question 6:**  Find the monthly revenue trend for the entire rental store over time.

**Ans:** To find the monthly revenue trend, you need to extract the year and month from the payment_date in the payment table, and then GROUP BY that new value to SUM() the revenue for each period.

```sql
-- This query calculates the total revenue for each month.
-- It uses the DATE_FORMAT function to group all payments by their year and month,
-- and then sums the payment amounts for each group to find the monthly revenue.

SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS payment_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
GROUP BY
    payment_month
ORDER BY
    payment_month;
```

Explanation of the Query:
  - SELECT DATE_FORMAT(payment_date, '%Y-%m') AS payment_month, SUM(amount) AS monthly_revenue:
    - DATE_FORMAT(payment_date, '%Y-%m'): This function extracts the year (%Y) and month (%m) from the payment_date and formats it as a string (e.g., '2025-09'). This allows us to group all payments from the same month together, regardless of the day.
    - SUM(amount): This calculates the total revenue for each group.
  - FROM payment: This specifies that you are querying the payment table.
  - GROUP BY payment_month: This groups all the payment records based on the payment_month we created, so the SUM() function calculates the total revenue for each month individually.
  - ORDER BY payment_month: This sorts the results chronologically, making it easy to see the revenue trend over time.

***Question 7:** Identify the customers whose total spending on rentals falls within the top 20% of all customers.

**Ans:** To identify the top 20% of customers by their total spending, you can use the NTILE() window function. This function is perfect for dividing an ordered set of rows into a specified number of equal-sized groups.

By dividing the customers into 5 groups (NTILE(5)), the first group will represent the top 20%.

```sql
-- This query identifies the top 20% of customers based on their total rental spending.
-- It uses a CTE to first calculate each customer's total spending,
-- and then another CTE with the NTILE(5) window function to find the top quintile.

WITH CustomerSpending AS (
    -- First, calculate the total amount spent by each customer
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM
        customer c
    INNER JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
),
RankedCustomers AS (
    -- Next, divide the customers into 5 equal groups (quintiles) based on their spending
    SELECT
        first_name,
        last_name,
        total_spent,
        NTILE(5) OVER (ORDER BY total_spent DESC) AS spending_quintile
    FROM
        CustomerSpending
)
-- Finally, select only the customers from the top group (quintile 1)
SELECT
    first_name,
    last_name,
    total_spent
FROM
    RankedCustomers
WHERE
    spending_quintile = 1;
```

Explanation of the Query:
  1. WITH CustomerSpending AS (...): The first Common Table Expression (CTE) calculates the total_spent for each customer by joining the customer and payment tables and using SUM() with GROUP BY.
  2. WITH RankedCustomers AS (...): The second CTE takes the results from the first and applies the window function:
      - NTILE(5) OVER (ORDER BY total_spent DESC):
        - ORDER BY total_spent DESC: This first sorts all customers from the highest spending to the lowest.
        - NTILE(5): This function then divides the sorted list into 5 equal-sized groups, or "quintiles". It assigns a number from 1 to 5 to each customer. The highest spenders get 1, the next group gets 2, and so on.
  3. Final SELECT Statement:
      - WHERE spending_quintile = 1: This final step filters the results to show only the customers who were assigned to the first quintile, which represents the top 20% of spenders.

***Question 8:** Calculate the running total of rentals per category, ordered by rental count.

**Ans:** To calculate a running total of rentals per category, you first need to get the total count for each category, and then apply the SUM() window function to these totals.

Using a Common Table Expression (CTE) is the clearest way to structure this query.

```sql
-- This query calculates a running total of rental counts across movie categories.
-- It first calculates the total rentals for each category in a CTE,
-- then uses a window function to compute the cumulative sum.

WITH CategoryRentalCounts AS (
    -- Step 1: Count the total number of rentals for each category
    SELECT
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        category c
    INNER JOIN
        film_category fc ON c.category_id = fc.category_id
    INNER JOIN
        inventory i ON fc.film_id = i.film_id
    INNER JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        c.name
)
-- Step 2: Calculate the running total from the counts above
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total
FROM
    CategoryRentalCounts;
```

Explanation of the Query:
  1. WITH CategoryRentalCounts AS (...): This CTE first calculates the total rental_count for each movie category. It does this by joining the four necessary tables and using COUNT() with GROUP BY.
  2. Final SELECT Statement: This part of the query operates on the results from the CTE.
      - SELECT category_name, rental_count: It selects the category and its individual rental count.
      - SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total: This is the window function that calculates the running total.
          - SUM(rental_count): Specifies that we want a sum.
          - OVER (...): Defines the window for the sum.
          - ORDER BY rental_count DESC: This is the key part. It orders the rows from the highest rental_count to the lowest. The SUM() function then calculates a cumulative sum based on this order. It takes the value from the current row and adds it to the sum of all preceding rows.

***Question 9:**  Find the films that have been rented less than the average rental count for their respective categories.

**Ans:** This is a complex query that requires multiple steps. You need to:
  1. Calculate the rental count for each film.
  2. Calculate the average rental count for each category.
  3. Compare each film's count to its category's average.

Using Common Table Expressions (CTEs) and a window function is the most efficient and readable way to solve this.

```sql
-- This query identifies films that have been rented less than the average
-- number of times for their respective categories.

WITH FilmRentalCounts AS (
    -- Step 1: Get the rental count for each film along with its category
    SELECT
        c.name AS category_name,
        f.title,
        COUNT(r.rental_id) AS rental_count
    FROM
        rental r
    INNER JOIN inventory i ON r.inventory_id = i.inventory_id
    INNER JOIN film f ON i.film_id = f.film_id
    INNER JOIN film_category fc ON f.film_id = fc.film_id
    INNER JOIN category c ON fc.category_id = c.category_id
    GROUP BY
        c.name, f.title
),
FilmAndCategoryStats AS (
    -- Step 2: Use a window function to calculate the average rental count for each category
    SELECT
        category_name,
        title,
        rental_count,
        AVG(rental_count) OVER (PARTITION BY category_name) AS avg_category_rentals
    FROM
        FilmRentalCounts
)
-- Step 3: Filter the results to find films rented less than their category's average
SELECT
    category_name,
    title,
    rental_count,
    ROUND(avg_category_rentals, 2) AS avg_category_rentals -- Rounding for cleaner output
FROM
    FilmAndCategoryStats
WHERE
    rental_count < avg_category_rentals
ORDER BY
    category_name, rental_count;
```

Explanation of the Query:
  1. WITH FilmRentalCounts AS (...): The first CTE performs a large join to connect rentals to their film titles and categories. It then groups by category_name and title to get the specific rental_count for each movie.
  2. WITH FilmAndCategoryStats AS (...): The second CTE takes the data from the first CTE and adds a crucial piece of information using a window function:
      - AVG(rental_count) OVER (PARTITION BY category_name): This calculates the average rental count.
          - PARTITION BY category_name tells the function to calculate the average separately for each category (e.g., it calculates one average for 'Action', another for 'Comedy', etc.).
          - This gives us each film's individual rental count alongside the average for its specific category, all in the same row.

  3. Final SELECT Statement:
      - WHERE rental_count < avg_category_rentals: This final step simply filters the results from the second CTE, keeping only the rows where a film's individual rental_count is less than the calculated avg_category_rentals for its category.

***Question 10:**  Identify the top 5 months with the highest revenue and display the revenue generated in each month.

**Ans:** To identify the top 5 months with the highest revenue, you need to first calculate the total revenue for each month, then order the results in descending order, and finally, limit the output to the top 5.

```sql
-- This query identifies the top 5 months with the highest rental revenue.
-- It groups payments by month, sums the revenue, and then orders
-- the results to find the highest-grossing months.

SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS payment_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
GROUP BY
    payment_month
ORDER BY
    monthly_revenue DESC
LIMIT 5;
```

Explanation of the Query:
  - SELECT DATE_FORMAT(payment_date, '%Y-%m') AS payment_month, SUM(amount) AS monthly_revenue:
    - DATE_FORMAT(...): This function groups all payments by the year and month they occurred in.
    - SUM(amount): This calculates the total revenue for each of those monthly groups.
  - FROM payment: This specifies that the data comes from the payment table.
  - GROUP BY payment_month: This groups the payment records by the month, which is essential for the SUM() function to work correctly.
  - ORDER BY monthly_revenue DESC: This sorts the results from the highest revenue month to the lowest.
  - LIMIT 5: This final clause restricts the output to only the top 5 rows from the sorted result.

### Normalisation & CTE

*1.* First Normal Form (1NF):

  a. Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it to achieve 1NF.

**Ans:** Based on the mavenmovies schema, the film table violates the First Normal Form (1NF) due to the special_features column.

First Normal Form (1NF) requires that every column in a table hold a single, atomic (indivisible) value, and that each row be unique. The special_features column, defined as a SET type, can store multiple values in a single cell (e.g., 'Trailers,Commentaries,Deleted Scenes'), which violates the rule of atomicity.

**How to Normalize the film Table to 1NF**

To fix this, you would remove the multi-valued column and create a new table to store each special feature as a separate row. This is the standard process for eliminati

**Step 1: Create a New Junction Table**

First, create a new table, let's call it film_features, to link films to their special features. This table will hold one row for each feature a film has.

```sql
CREATE TABLE film_features (
    film_id SMALLINT UNSIGNED NOT NULL,
    feature VARCHAR(25) NOT NULL,
    PRIMARY KEY (film_id, feature), -- Composite primary key
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
```
  - film_id: A foreign key that links back to the original film table.
  - feature: A column that stores a single special feature (e.g., 'Trailers').
  - PRIMARY KEY (film_id, feature): A composite key ensures that a film cannot have the same feature listed more than once.

**Step 2: Remove the Old Column**
Next, you would remove the original special_features column from the film table.

```sql
ALTER TABLE film
DROP COLUMN special_features;
```

**Step 3: Populate the New Table**

Finally, you would populate the new film_features table.

(*By making this change, each cell now holds a single atomic value, and the film table conforms to the First Normal Form. This makes the data easier to query and manage.*)

In [ ]:
# ------------------------------------------------------------

2. Second Normal Form (2NF):

 a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.

 **Ans:** Second Normal Form (2NF) has two main requirements:
  1. The table must already be in First Normal Form (1NF).
  2. The table must have no partial dependencies. This means that every non-key attribute must be fully dependent on the entire primary key.

This rule is only relevant for tables that have a composite primary key (a primary key made up of two or more columns). If a table has a single-column primary key, it cannot have partial dependencies and is automatically in 2NF (assuming it's in 1NF).

**How to Determine if a Table is in 2NF**

Let's choose the film_actor table to analyze.

Its structure is:
  - actor_id (Primary Key, Foreign Key)
  - film_id (Primary Key, Foreign Key)
  - last_update

Here is the step-by-step process to determine if it is in 2NF:

1. Check for 1NF: The film_actor table is in 1NF. Each cell holds a single, atomic value.

2. Identify the Primary Key: The primary key for this table is a composite key made up of two columns: (actor_id, film_id). This combination uniquely identifies each row (i.e., which actor appeared in which film).

3. Identify Non-Key Attributes: A non-key attribute is any column that is not part of the primary key. In this table, the only non-key attribute is last_update.

4. Check for Partial Dependencies: Now, we check if any non-key attribute depends on only a part of the primary key.

    - Does last_update depend only on actor_id? No, the timestamp refers to when this specific actor-film relationship was last updated, not when the actor's general record was updated.

    - Does last_update depend only on film_id? No, for the same reason. It's specific to the actor's role in that film.

Since the non-key attribute (last_update) is dependent on the entire composite key (actor_id and film_id together), there are no partial dependencies.

**Conclusion: The film_actor table is already in 2NF.**

---

Example of a Violation and Normalization Steps:

To illustrate the process, let's imagine a poorly designed version of this table that violates 2NF.

Suppose the film_actor table was created like this:

film_actor_violates_2NF:
| actor_id | film_id | actor_first_name |
| :--- | :--- | :--- |
| 1 | 1 | PENELOPE |
| 1 | 23 | PENELOPE |
| 2 | 1 | NICK |

In this hypothetical table:
  - The primary key is still (actor_id, film_id).
  - The non-key attribute is actor_first_name.

This table violates 2NF because actor_first_name is partially dependent on the primary key. The actor's first name depends only on the actor_id part of the key. It has nothing to do with the film_id. This creates data redundancy—'PENELOPE' is stored multiple times for the same actor.

Steps to Normalize it to 2NF
  1. Identify the Partial Dependency: Recognize that actor_first_name depends only on actor_id.
  2. Decompose the Table: Split the table into two separate tables to remove the partial dependency.
      - One table will hold the relationship between actors and films.
      - The other will hold the information that was partially dependent (the actor's name).

Step 1: Create a separate actors table. (This already exists in the real Sakila database). This table will store the actor's information.

actors table:
| actor_id | actor_first_name |
| :--- | :--- |
| 1 | PENELOPE |
| 2 | NICK |

Step 2: Remove the partially dependent column from the original table. The film_actor table now only contains the columns that make up the primary key, correctly representing the many-to-many relationship.

film_actor table (Normalized):
| actor_id | film_id |
| :--- | :--- |
| 1 | 1 |
| 1 | 23 |
| 2 | 1 |

By splitting the table, we have eliminated the partial dependency and the data redundancy. The film_actor table is now in 2NF, and we can get the actor's name by joining it with the actors table.

In [ ]:
# ---------------------------------------------------------------------

3. Third Normal Form (3NF):

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.

**Ans:** Third Normal Form (3NF) requires that a table is already in 2NF and that it has no transitive dependencies.

A transitive dependency exists when a non-key attribute is indirectly dependent on the primary key through another non-key attribute. The chain of dependency looks like this:
Primary Key → Non-Key Attribute 1 → Non-Key Attribute 2

---

**Identifying a 3NF Violation**

In the Sakila database, the tables are already well-normalized, and a clear 3NF violation is not present in the final schema. However, we can look at the customer_list view to see an example of what a table that violates 3NF would look like.

Let's imagine a denormalized customer_report table based on that view:

**customer_report table (Violates 3NF):**
| customer_id (PK) | first_name | last_name | address | city | country |
| :--- | :--- | :--- | :--- | :--- | :--- |
| 1 | MARY | SMITH | 123 Main St | Lethbridge | Canada |
| 2 | PATRICIA | JOHNSON | 456 Oak Ave | Woodridge | Australia |


**Transitive Dependencies Present**
In this hypothetical customer_report table:
  - The Primary Key is customer_id.

The following transitive dependencies exist:
  - customer_id → city → country


The country depends on the city, and the city depends on the customer_id (indirectly via their address). The country is not directly determined by the customer themselves, but by their city. This causes data redundancy; for every customer in 'Lethbridge', the country 'Canada' would be repeated.

---

**Steps to Normalize the Table to 3NF**

To fix this, you must remove the transitive dependencies by splitting the table. The goal is to make every non-key attribute dependent only on the primary key.

**Step 1: Remove the transitively dependent address columns from the main table.**

First, create a separate address table that contains all the location-specific details. The original customer table will only keep a foreign key to link to the address. This is exactly how the actual Sakila database is designed.

**customer table (Normalized):**
| customer_id (PK) | first_name | last_name | address_id (FK) |
| :--- | :--- | :--- | :--- |
| 1 | MARY | SMITH | 5 |
| 2 | PATRICIA | JOHNSON | 6 |

**Step 2: Create new tables for the dependent attributes.**

Next, create the address, city, and country tables to store the location information hierarchically, removing the transitive dependencies.

**address table:**
| address_id (PK) | address | city_id (FK) |
| :--- | :--- | :--- |
| 5 | 123 Main St | 300 |
| 6 | 456 Oak Ave | 576 |

**city table:**
| city_id (PK) | city | country_id (FK) |
| :--- | :--- | :--- |
| 300 | Lethbridge | 20 |
| 576 | Woodridge | 8 |

**country table:**
| country_id (PK) | country |
| :--- | :--- |
| 20 | Canada |
| 8 | Australia |

By decomposing the original table, we have eliminated the transitive dependencies. Now, each attribute in each table is dependent only on its table's primary key. The entire schema is now in 3NF, which reduces data redundancy and improves data integrity.

4. Normalization Process:

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to at least 2NF.

**Ans:** Let's take a hypothetical, unnormalized table that combines information from several places in the Sakila database and walk through normalizing it to the Second Normal Form (2NF).

**The Unnormalized Table**

Imagine we start with a flat report that lists every single item in every rental order. The business wants to see the film title, the category name, and the customer's name on each line.

An unnormalized version might look like this:

**Unnormalized_Rentals Table:**
| rental_id | customer_name   | film_titles_and_categories                           |
|-----------|-----------------|------------------------------------------------------|
| 1         | MARY SMITH      | ZORRO ARK (Horror), BUCKET BROTHERHOOD (Action)      |
| 2         | PATRICIA JOHNSON| APACHE DIVINE (Classics)                             |


This table has several problems:
  - It violates the rule of atomicity because the film_titles_and_categories column contains multiple distinct values (a list of movies).
  - It's difficult to query (e.g., "How many 'Action' movies were rented?").
  - It creates a lot of redundant data.

**Step 1: Achieving First Normal Form (1NF)**

Goal: Ensure every cell has a single, atomic value and every row is unique.

To achieve 1NF, we must eliminate the repeating group in the film_titles_and_categories column. We do this by decomposing the table, giving each film in a rental its own separate row.

**1NF Normalized_Rentals Table:**
| rental_id | customer_id | customer_name     | film_id | film_title         | category_name |
|-----------|-------------|------------------|---------|--------------------|---------------|
| 1         | 1           | MARY SMITH       | 1000    | ZORRO ARK          | Horror        |
| 1         | 1           | MARY SMITH       | 101     | BUCKET BROTHERHOOD | Action        |
| 2         | 2           | PATRICIA JOHNSON | 25      | APACHE DIVINE      | Classics      |

Now, every cell has a single value. We can define a composite primary key of (rental_id, film_id) to uniquely identify each row. The table is now in 1NF.

However, it's still not ideal. There's a lot of redundancy:
  - MARY SMITH is repeated for every item in her rental.
  - ZORRO ARK and Horror would be repeated every time that film is rented.


**tep 2: Achieving Second Normal Form (2NF)**

Goal: Be in 1NF and eliminate all partial dependencies. A partial dependency occurs when a non-key attribute depends on only part of a composite primary key.


Our Normalized_Rentals table has a composite primary key: (rental_id, film_id). Let's check the non-key attributes:
  - customer_name: Depends only on customer_id (which depends on rental_id). It has nothing to do with film_id. This is a partial dependency.
  - film_title: Depends only on film_id. It has nothing to do with rental_id. This is a partial dependency.
  - category_name: Depends only on film_id (indirectly). It has nothing to do with rental_id. This is also a partial dependency.
  - To fix this, we decompose the table further, splitting it into entities that are fully dependent on their keys. This process results in the actual, well-designed tables you see in the Sakila database.


**The Normalized 2NF Schema:**
1. rentals Table:
| rental_id (PK) | customer_id (FK) |
| :--- | :--- |
| 1 | 1 |
| 2 | 2 |

2. rental_items (Junction Table):
| rental_id (PK, FK) | film_id (PK, FK) |
| :--- | :--- |
| 1 | 1000 |
| 1 | 101 |
| 2 | 25 |

3. customers Table:
| customer_id (PK) | customer_name |
| :--- | :--- |
| 1 | MARY SMITH |
| 2 | PATRICIA JOHNSON|

4. films Table:
| film_id (PK) | film_title | category_id (FK) |
| :--- | :--- | :--- |
| 1000 | ZORRO ARK | 11 |
| 101 | BUCKET BROTHERHOOD | 1 |
| 25 | APACHE DIVINE | 4 |

By splitting the single, messy table into multiple, focused tables, we have eliminated the partial dependencies. Every non-key attribute is now fully dependent on its table's primary key. The schema is now in 2NF, which significantly reduces data redundancy and prevents data modification anomalies.

In [ ]:
# -----------------------------------------------------------------------------------

5. CTE Basics:

 a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables.

**Ans:** Of course. A Common Table Expression (CTE) is an excellent way to structure this query, as it allows you to first prepare the data (by counting the films per actor) and then select from that prepared set.

Here is the query using a CTE to get the name of each actor and the number of films they've acted in.

```sql
-- This query uses a Common Table Expression (CTE) to first calculate
-- the number of films each actor has appeared in, and then displays the results.

WITH ActorFilmCounts AS (
    -- This CTE joins the actor and film_actor tables
    -- and counts the number of films for each actor.
    SELECT
        a.first_name,
        a.last_name,
        COUNT(fa.film_id) AS number_of_films
    FROM
        actor a
    INNER JOIN
        film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, a.first_name, a.last_name
)
-- This final SELECT statement retrieves the data from the CTE
-- and orders it to show the most prolific actors first.
SELECT
    first_name,
    last_name,
    number_of_films
FROM
    ActorFilmCounts
ORDER BY
    number_of_films DESC;
```

Explanation of the Query:
  1. WITH ActorFilmCounts AS (...): This defines the Common Table Expression.
      - We JOIN the actor table with the film_actor table on actor_id to link actors to their films.
      - COUNT(fa.film_id) counts the number of film entries for each actor.
      - GROUP BY a.actor_id, a.first_name, a.last_name ensures that the counting is done for each unique actor.
      - The result of this subquery is a temporary table named ActorFilmCounts that contains the actor's name and their total film count.
  2. SELECT ... FROM ActorFilmCounts: This is the final query that is executed.
      - It treats ActorFilmCounts just like a regular table.
      - It selects the name and the calculated number_of_films from the CTE.
      - ORDER BY number_of_films DESC sorts the final result to show the actors who have appeared in the most films at the top.

(*The query will return a list of all actors, along with the total count of films they have acted in, ordered from most films to least*)

In [ ]:
# -----------------------------------------------------

6. CTE with Joins:

 a. Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.

**Ans:** Of course. Here is a query that uses a Common Table Expression (CTE) to combine information from the film and language tables.

```sql
-- This query uses a CTE to create a temporary, combined view of film titles,
-- their languages, and their rental rates.

WITH FilmLanguageInfo AS (
    -- The CTE joins the film and language tables to bring the language name
    -- together with the film's details.
    SELECT
        f.title,
        l.name AS language_name,
        f.rental_rate
    FROM
        film f
    INNER JOIN
        language l ON f.language_id = l.language_id
)
-- The final SELECT statement simply retrieves and displays the data from the CTE.
SELECT
    title,
    language_name,
    rental_rate
FROM
    FilmLanguageInfo;
```

Explanation of the Query:
  1. WITH FilmLanguageInfo AS (...): This defines the Common Table Expression named FilmLanguageInfo.
      - Inside the CTE, we perform an INNER JOIN between the film table (aliased as f) and the language table (aliased as l) on their common language_id column.
      - It selects the title and rental_rate from the film table, and the name of the language (which is aliased as language_name for clarity).
      - This effectively creates a simple, temporary table that has exactly the information we need.
  2. SELECT ... FROM FilmLanguageInfo: This is the main query. Instead of querying the original tables, it queries the clean, pre-joined data from our FilmLanguageInfo CTE.

(*The query will return a list of every film, its language, and its rental rate*)

In [ ]:
# -------------

7. CTE for Aggregation:

 a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tables.

**Ans:** Using a Common Table Expression (CTE) is a very clean and readable way to perform this kind of aggregation before joining to get the customer details.

Here is the query to find the total revenue generated by each customer.

```sql
-- This query uses a CTE to first calculate the total revenue for each customer ID,
-- and then joins that result with the customer table to display their names.

WITH CustomerRevenue AS (
    -- The CTE aggregates the payment table to find the sum of payments for each customer.
    SELECT
        customer_id,
        SUM(amount) AS total_revenue
    FROM
        payment
    GROUP BY
        customer_id
)
-- The final SELECT statement joins the CTE with the customer table
-- to get the full name of each customer alongside their total spending.
SELECT
    c.first_name,
    c.last_name,
    cr.total_revenue
FROM
    CustomerRevenue cr
INNER JOIN
    customer c ON cr.customer_id = c.customer_id
ORDER BY
    cr.total_revenue DESC; -- Optional: Orders the result to show the highest-spending customers first.
```

Explanation of the Query:
  1. WITH CustomerRevenue AS (...): This defines the Common Table Expression.
      - Inside the CTE, we query the payment table.
      - SUM(amount) calculates the total amount paid.
      - GROUP BY customer_id ensures that the SUM() function calculates the total for each unique customer, creating a temporary table that maps customer_id to total_revenue.
  2. SELECT ... FROM CustomerRevenue cr INNER JOIN customer c ...: This is the main query.
      - It treats our CTE (CustomerRevenue) as a standard table, giving it the alias cr.
      - It performs an INNER JOIN with the customer table (c) on their common customer_id column. This links the calculated total revenue to the customer's name.
      - Finally, it selects the customer's name and their calculated total revenue.
(*The query will return a list of all customers along with the total revenue they have generated, sorted from highest to lowest*)

In [ ]:
# -----------------

8. CTE with Window Functions:

 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.

**Ans:** You can use a Common Table Expression (CTE) to select the film data first, and then apply the RANK() window function in the final SELECT statement to rank the films by their rental duration.

```sql
-- This query uses a CTE and a window function to rank films
-- based on their rental duration, from longest to shortest.

WITH FilmDurations AS (
    -- The CTE simply selects the necessary columns from the film table.
    SELECT
        title,
        rental_duration
    FROM
        film
)
-- The final SELECT statement queries the CTE and applies the RANK() function.
SELECT
    title,
    rental_duration,
    RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank
FROM
    FilmDurations;
```

Explanation of the Query:
  1. WITH FilmDurations AS (...): This defines a simple Common Table Expression that creates a temporary result set containing just the title and rental_duration for every film. This makes the main query slightly cleaner.
  2. SELECT ... FROM FilmDurations: This is the main query that operates on our CTE.
  3. RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank: This is the window function that performs the ranking.
      - ORDER BY rental_duration DESC: This sorts all the films within the "window" (in this case, the entire table) from the longest rental duration to the shortest.
      - RANK(): The function then assigns a rank to each film based on this order. If multiple films have the same duration, they will receive the same rank, and the next rank will be skipped (e.g., 1, 1, 3).
      
(*The query will return a list of all films, their rental duration, and a new column with their rank based on that duration.*)

In [ ]:
# -------------

9. CTE and Filtering:

 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

**Ans:** To get the details of customers who have made more than two rentals, you can use a CTE to first identify these customers and then join that list back to the customer table.

```sql
-- This query uses a CTE to identify customers who have made more than two rentals,
-- and then retrieves their full details.

WITH FrequentRenters AS (
    -- This CTE creates a list of customer_ids for customers
    -- who have more than two rental records.
    SELECT
        customer_id
    FROM
        rental
    GROUP BY
        customer_id
    HAVING
        COUNT(rental_id) > 2
)
-- The final SELECT statement joins the main customer table with the CTE
-- to fetch the details of only the frequent renters.
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email
FROM
    customer c
INNER JOIN
    FrequentRenters fr ON c.customer_id = fr.customer_id;
```

Explanation of the Query:
  1. WITH FrequentRenters AS (...): This defines the Common Table Expression.
      - Inside the CTE, we query the rental table.
      - GROUP BY customer_id groups all rental records by the customer who made them.
      - HAVING COUNT(rental_id) > 2 is a filter that is applied after grouping. It ensures that only the customer_ids of customers with a rental count greater than 2 are included in the CTE's result set.
  2. SELECT ... FROM customer c INNER JOIN FrequentRenters fr ...: This is the main query.
      - It joins the customer table with our temporary FrequentRenters list on customer_id.
      - Because it's an INNER JOIN, the final result will only include customers who exist in both tables—effectively, only the frequent renters we identified in the CTE.

(*The query will return the details for every customer who has rented three or more movies.*)

In [ ]:
# -------------------------

10. CTE for Date Calculations:

 a. Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table

**Ans:** Using a Common Table Expression (CTE) is a great way to first process the date information and then perform the aggregation in a separate, clean step.

Here is the query to find the total number of rentals for each month.

```sql
-- This query uses a CTE to calculate the total number of rentals for each month.
-- The CTE first extracts the year and month from each rental_date.

WITH MonthlyRentals AS (
    -- This CTE creates a temporary table with a formatted 'rental_month'
    -- for every single rental record.
    SELECT
        DATE_FORMAT(rental_date, '%Y-%m') AS rental_month
    FROM
        rental
)
-- The final SELECT statement queries the CTE to count the rentals per month.
SELECT
    rental_month,
    COUNT(*) AS total_rentals
FROM
    MonthlyRentals
GROUP BY
    rental_month
ORDER BY
    rental_month;
```

Explanation of the Query:
  1. WITH MonthlyRentals AS (...): This defines the Common Table Expression.
      - Inside the CTE, we query the rental table.
      - DATE_FORMAT(rental_date, '%Y-%m') is a function that takes the rental_date and formats it into a 'Year-Month' string (e.g., '2025-09'). This is aliased as rental_month.
      - The result is a temporary table containing a single column (rental_month) with an entry for every rental that has occurred.
  2. SELECT ... FROM MonthlyRentals: This is the main query that operates on our CTE.
      - It selects the rental_month.
      - COUNT(*) counts all the rows for each group, which gives us the total number of rentals.
      - GROUP BY rental_month groups all the records by the month they occurred in, so the COUNT() function can aggregate them correctly.
      - ORDER BY rental_month sorts the final output chronologically.

(*The query will return a summary table showing each month and the total number of rentals that occurred during that month.*)

In [ ]:
# ---------------

11. CTE and Self-Join:

 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

**Ans:** To generate a report of actor pairs who have appeared in the same film, you need to perform a self-join on the film_actor table. Using a CTE can help organize the data, especially for joining with the actor table to get the names.

```sql
-- This query uses a CTE and a self-join to find pairs of actors who have acted together.

WITH FilmActorDetails AS (
    -- The CTE joins film_actor with actor to get the actor's full name and film_id.
    SELECT
        fa.film_id,
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name
    FROM
        film_actor fa
    JOIN
        actor a ON fa.actor_id = a.actor_id
)
-- The final query self-joins the CTE to find pairs and adds the film title.
SELECT
    f.title AS film_title,
    fad1.actor_name AS actor_1,
    fad2.actor_name AS actor_2
FROM
    FilmActorDetails fad1
JOIN
    FilmActorDetails fad2 ON fad1.film_id = fad2.film_id AND fad1.actor_id < fad2.actor_id
JOIN
    film f ON fad1.film_id = f.film_id
ORDER BY
    film_title, actor_1;
```

Explanation of the Query:
  1. WITH FilmActorDetails AS (...): This CTE prepares the data by joining film_actor and actor to create a temporary table that maps each film_id to the actor_id and full actor_name of an actor in that film.
  2. FROM FilmActorDetails fad1 JOIN FilmActorDetails fad2 ...: This is the self-join. We are joining the CTE to itself, giving each instance a different alias (fad1 and fad2).
  3. ON fad1.film_id = fad2.film_id AND fad1.actor_id < fad2.actor_id: This is the crucial join condition that creates the pairs.
      - fad1.film_id = fad2.film_id: This ensures that we only pair actors who appeared in the exact same film.
      - fad1.actor_id < fad2.actor_id: This clever condition accomplishes two things:
          - It prevents an actor from being paired with themselves (since actor_id can't be less than itself).
          - It eliminates duplicate pairs. Without it, you would get a row for (Actor A, Actor B) and another for (Actor B, Actor A). This condition ensures you only get the pair once.
  4. JOIN film f ON fad1.film_id = f.film_id: After finding the pairs, we join with the film table to get the title of the movie they appeared in together, making the report much more readable.

(*The query will produce a list of films, with each row showing a unique pair of actors who starred in that film together.*)

In [ ]:
# ---------------------

12. CTE for Recursive Search:

 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column

**Ans:** The standard staff table in the Sakila (Mavenmovies) database does not have a reports_to column to represent a multi-level management hierarchy. The structure is flat, with one manager per store.

To demonstrate how a recursive CTE works for this kind of problem, we'll need to use a hypothetical employees table that has a self-referencing manager_id column.

1. Hypothetical Table Setup

First, let's imagine we have an employees table structured like this:

```sql
-- This is a hypothetical table to demonstrate a recursive query.
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    manager_id INT -- This column refers back to another employee_id
);

INSERT INTO employees (employee_id, employee_name, manager_id) VALUES
(1, 'Jon Snow (CEO)', NULL),
(2, 'Daenerys Targaryen (VP)', 1),
(3, 'Tyrion Lannister (VP)', 1),
(4, 'Arya Stark (Director)', 2),
(5, 'Sansa Stark (Director)', 2),
(6, 'Bronn (Manager)', 3),
(7, 'Samwell Tarly (Analyst)', 4);
```

2. The Recursive CTE Query

Now, here is the recursive CTE to find all employees who report up to a specific manager (e.g., the CEO, employee_id = 1).

```sql
-- This query uses a recursive CTE to find the entire reporting hierarchy
-- under a specific manager (in this case, employee_id = 1).

WITH RECURSIVE EmployeeHierarchy AS (
    -- 1. Anchor Member: The starting point of the recursion.
    -- We select the top-level manager we want to start from.
    SELECT
        employee_id,
        employee_name,
        manager_id,
        0 AS hierarchy_level -- Start level at 0
    FROM
        employees
    WHERE
        employee_id = 1 -- The ID of the top-level manager

    UNION ALL

    -- 2. Recursive Member: This part joins the CTE to itself.
    -- It finds all employees whose manager_id is in the result set from the previous step.
    SELECT
        e.employee_id,
        e.employee_name,
        e.manager_id,
        eh.hierarchy_level + 1 -- Increment the level for each recursion
    FROM
        employees e
    INNER JOIN
        EmployeeHierarchy eh ON e.manager_id = eh.employee_id
)
-- 3. Final SELECT: Retrieve all results from the CTE.
SELECT * FROM EmployeeHierarchy;
```

**How the Recursive CTE Works**

A recursive CTE has two parts connected by a UNION ALL:
  1. The Anchor Member: This is the initial SELECT statement before the UNION ALL. It's the base case for the recursion. In our query, it selects the CEO ('Jon Snow'), which becomes the first result in our EmployeeHierarchy.
  2. The Recursive Member: This is the SELECT statement after the UNION ALL. It references the CTE itself (EmployeeHierarchy eh). The query runs in a loop:
      - Iteration 1: It looks for employees in the employees table whose manager_id matches the employee_ids currently in the CTE (which is just the CEO, ID 1). It finds the two VPs (Daenerys and Tyrion) and adds them to the result set.
      - Iteration 2: It runs again, this time looking for employees whose manager_id matches the IDs now in the CTE (1, 2, and 3). It finds the Directors and the Manager.
      - This process continues until the recursive member finds no new employees to add, at which point the query stops.

(*The query will return the complete reporting chain, starting from the specified manager.*)